import { NewsDetailedType } from "@src/types/NewsDetailedTypes";

export const newsDetailedData: NewsDetailedType = {
  image: "newsSlideImg",
  title: "Свежая новость уже на сайте!",
  text: {
    paragraphFirst:
      "С 26 июня по 14 июля этого года пройдет Уимблдонский турнир по теннису. Ещё его называют Открытым Чемпионатом Англии, который собирает самых сильных теннисистов со всего земного шара. Спортсмен, который получит золото, наберёт множество рейтинговых баллов АТР, WTA. А это значит, что он будет признан лучшим в мире. Среди букмекерских контор этот чемпионат набирает самое большое количество ставок, после футбола. JohnnyBet предлагает надежные букмекерские конторы, в которых можно делать ставки на это событие безопасно. В этот статье мы предлагаем рассмотреть главных претендентов на победу в Уимблдон 2019. Давайте начнем с мужского одиночного разряда. По мнению большинства букмекеров и уже сделанных ставок, в лидеры вырывается швейцарский теннисист Роджер Федерер. Его имя выбрано не случайно, ведь он уже становился победителем. Это произошло в 2003-2007, 2009, 2012 и 2018 годах. То, какой уровень игры он задал в прошлом году, сложно будет превзойти. Второе место в Открытом Чемпионате Англии может занять Джокович Новак Сербский. Если вы наблюдаете за теннисными турнирами, то знаете что это профессиональный игрок, который вырвал победу в 2014 и 2015 годах. Проанализировав прошедшие игры, он вполне способен получить кубок и в 2019-м году. Бронзу может получить Рафаэль Надаль. Это испанский теннисист, на счету которого 14 титулов на Турнирах Большого шлема. Кстати, в 2008 и в 2010 годах он занял первое место в Уимблдонском Чемпионате.",
    paragraphSecond:
      "С 26 июня по 14 июля этого года пройдет Уимблдонский турнир по теннису. Ещё его называют Открытым Чемпионатом Англии, который собирает самых сильных теннисистов со всего земного шара. Спортсмен, который получит золото, наберёт множество рейтинговых баллов АТР, WTA. А это значит, что он будет признан лучшим в мире. Среди букмекерских контор этот чемпионат набирает самое большое количество ставок, после футбола. JohnnyBet предлагает надежные букмекерские конторы, в которых можно делать ставки на это событие безопасно. В этот статье мы предлагаем рассмотреть главных претендентов на победу в Уимблдон 2019. Давайте начнем с мужского одиночного разряда. По мнению большинства букмекеров и уже сделанных ставок, в лидеры вырывается швейцарский теннисист Роджер Федерер. Его имя выбрано не случайно, ведь он уже становился победителем. Это произошло в 2003-2007, 2009, 2012 и 2018 годах. То, какой уровень игры он задал в прошлом году, сложно будет превзойти. Второе место в Открытом Чемпионате Англии может занять Джокович Новак Сербский. Если вы наблюдаете за теннисными турнирами, то знаете что это профессиональный игрок, который вырвал победу в 2014 и 2015 годах. Проанализировав прошедшие игры, он вполне способен получить кубок и в 2019-м году. Бронзу может получить Рафаэль Надаль. Это испанский теннисист, на счету которого 14 титулов на Турнирах Большого шлема. Кстати, в 2008 и в 2010 годах он занял первое место в Уимблдонском Чемпионате.",
  },
  slider: [
    {
      id: "1",
      img: "newsDetailedSlideImg",
      alt: "Image of news",
    },
    {
      id: "2",
      img: "newsDetailedSlideImg",
      alt: "Image of news",
    },
    {
      id: "3",
      img: "newsDetailedSlideImg",
      alt: "Image of news",
    },
  ],
  socialMedia: [
    {
      id: "1",
      icon: "TelegramIcon",
      text: "125",
      href: "#",
    },
    {
      id: "2",
      icon: "InstagramIcon",
      text: "143",
      href: "#",
    },
    {
      id: "3",
      icon: "WhatsappIcon",
      text: "37",
      href: "#",
    },
    {
      id: "4",
      icon: "VKIcon",
      text: "97",
      href: "#",
    },
  ],
  otherNews: {
    title: "Новости Лайма",
    color: "#A1D214",
    button: {
      text: "Смотреть все",
      href: "/news",
    },
    items: [
      {
        id: "1",
        img: "newsFirst",
        title: "Открытие нового магазина!",
        text: "Выбирайте из 40 000 товаров: у нас есть фрукты и овощи, мясо и рыба, все для дома и товары для животных  мясо и рыба, все для дома и товары для животных  мясо и рыба, все для дома и товары для животных",
        link: {
          title: "Читать дальше",
          href: "/news/1",
        },
      },
      {
        id: "2",
        img: "newsSecond",
        title: "Конкурс рецептов Лайма",
        text: "Выбирайте из 40 000 товаров: у нас есть фрукты и овощи, мясо и рыба, все для дома и товары для животных  мясо и рыба, все для дома и товары для животных  мясо и рыба, все для дома и товары для животных",
        link: {
          title: "Читать дальше",
          href: "/news/2",
        },
      },
      {
        id: "3",
        img: "newsThird",
        title: "Доставка теперь за 45 минут!",
        text: "Выбирайте из 40 000 товаров: у нас есть фрукты и овощи, мясо и рыба, все для дома и товары для животных  мясо и рыба, все для дома и товары для животных  мясо и рыба, все для дома и товары для животных",
        link: {
          title: "Читать дальше",
          href: "/news/3",
        },
      },
      {
        id: "4",
        img: "newsFourth",
        title: "Теперь и в Деливери!",
        text: "Выбирайте из 40 000 товаров: у нас есть фрукты и овощи, мясо и рыба, все для дома и товары для животных  мясо и рыба, все для дома и товары для животных  мясо и рыба, все для дома и товары для животных",
        link: {
          title: "Читать дальше",
          href: "/news/4",
        },
      },
    ],
  },
};
